# YOLO26 + C2f-DCN + EMA + BiFPN
nc: 10
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C2fDCN, [512, False, 1, 0.5]] # 4-P3/8，增强弯曲/细长标线特征
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C2fDCN, [512, True, 1, 0.5]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C2fDCN, [1024, True, 1, 0.5]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 1, EMA, [8]] # 11-P5/32

head:
  - [[4, 6, 11], 1, BiFPN, [256, 1]] # 12: 输出 [P3, P4, P5]
  - [-1, 1, Index, [256, 0]] # 13-P3
  - [-2, 1, Index, [256, 1]] # 14-P4
  - [-3, 1, Index, [256, 2]] # 15-P5
  - [[13, 14, 15], 1, Detect, [nc]]
